<?php
/**********************************************************************************************************************
 * 
 * Copyright (c) 2010 babeltime.com, Inc. All Rights Reserved
 * $Id: Formation.cfg.php 39329 2013-02-25 14:22:02Z YangLiu $
 * 
 **********************************************************************************************************************/

 /**
 * @file $HeadURL: svn://192.168.1.80:3698/C/tags/pirate/rpcfw/rpcfw_1-0-21-57/conf/Formation.cfg.php $
 * @author $Author: YangLiu $(liuyang@babeltime.com)
 * @date $Date: 2013-02-25 22:22:02 +0800 (一, 2013-02-25) $
 * @version $Revision: 39329 $
 * @brief 
 *  
 **/

class FormationConf
{
    
	const INIT_FOR_ID = 10001;					// 初始阵型ID


	/**
	 * 需要改变的属性ID数组 —— 获取用
	 */
	public static $EXT_ATTR = array(
		29,										// 调整物理攻击基础值
		30,										// 调整必杀攻击基础值
		31,										// 调整魔法攻击基础值
		32,										// 调整物理防御基础值
		33,										// 调整必杀防御基础值
		34,										// 调整魔法防御基础值
		24,										// 调整生命基础值
		26,										// 调整力量值点数
		27,										// 调整敏捷值点数
		28,										// 调整智慧值点数
	);


	/**
	 * 需要改变的属性ID数组 —— 传参用
	 */
	public static $EXT_ATTR_PARA = array(
		29 => 6,								// 调整物理攻击基础值
		30 => 7,								// 调整必杀攻击基础值
		31 => 8,								// 调整魔法攻击基础值
		32 => 9,								// 调整物理防御基础值
		33 => 10,								// 调整必杀防御基础值
		34 => 11,								// 调整魔法防御基础值
		24 => 1,								// 调整生命基础值
		26 => 3,								// 调整力量值点数
		27 => 4,								// 调整敏捷值点数
		28 => 5,								// 调整智慧值点数
	);
}
/* vim: set ts=4 sw=4 sts=4 tw=100 noet: */
